---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationX
source: html/1a531067-c312-8532-4517-c5a0a3df75cb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationX Property

"X Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalLinkReleaseRotationX { get; }
```